app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "School 101"], ["room_number", 101], ["created_at", "2020-06-07 22:24:57.423680"], ["updated_at", "2020-06-07 22:24:57.423680"]]
---
    def create
        @school_classes = SchoolClass.create(params.require(:school_class).permit(:title, :room_number))

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 104], ["updated_at", "2020-06-07 22:36:41.559687"], ["id", 7]]
---
    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class.update(params.require(:school_class).permit(:title, :room_number))