app/controllers/students_controller.rb

    def create
        @student = Student.create(params.require(:student).permit(:first_name, :last_name))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bashir"], ["last_name", "Mohd"], ["created_at", "2020-06-07 22:55:17.088570"], ["updated_at", "2020-06-07 22:55:17.088570"]]

    def update
        @student = Student.find(params[:id])
        @student.update(params.require(:student).permit(:first_name, :last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Mohamed"], ["updated_at", "2020-06-07 22:55:35.683689"], ["id", 3]]